reports/mysql-coupon-loadtest/runs/diag3-n100-500rps-004/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.5s), 0006/3000 VUs, 247 complete and 0 interrupted iterations
unique_member_first_request   [   5% ] 0006/3000 VUs  00.5s/10s  500.00 iters/s

running (01.5s), 0039/3000 VUs, 716 complete and 0 interrupted iterations
unique_member_first_request   [  15% ] 0039/3000 VUs  01.5s/10s  500.00 iters/s

running (02.5s), 0035/3000 VUs, 1219 complete and 0 interrupted iterations
unique_member_first_request   [  25% ] 0035/3000 VUs  02.5s/10s  500.00 iters/s

running (03.5s), 0054/3000 VUs, 1699 complete and 0 interrupted iterations
unique_member_first_request   [  35% ] 0054/3000 VUs  03.5s/10s  500.00 iters/s

running (04.5s), 0488/3000 VUs, 1766 complete and 0 interrupted iterations
unique_member_first_request   [  45% ] 0488/3000 VUs  04.5s/10s  500.00 iters/s

running (05.5s), 0863/3000 VUs, 1889 complete and 0 interrupted iterations
unique_member_first_request   [  55% ] 0863/3000 VUs  05.5s/10s  500.00 iters/s

running (06.5s), 1031/3000 VUs, 2224 complete and 0 interrupted iterations
unique_member_first_request   [  65% ] 1031/3000 VUs  06.5s/10s  500.00 iters/s

running (07.5s), 1188/3000 VUs, 2565 complete and 0 interrupted iterations
unique_member_first_request   [  75% ] 1188/3000 VUs  07.5s/10s  500.00 iters/s

running (08.5s), 1070/3000 VUs, 3183 complete and 0 interrupted iterations
unique_member_first_request   [  85% ] 1070/3000 VUs  08.5s/10s  500.00 iters/s

running (09.5s), 1059/3000 VUs, 3682 complete and 0 interrupted iterations
unique_member_first_request   [  95% ] 1059/3000 VUs  09.5s/10s  500.00 iters/s

running (10.5s), 0696/3000 VUs, 4306 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1023/3000 VUs  10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 5002   448.106399/s
    checks_succeeded...: 99.92% 4998 out of 5002
    checks_failed......: 0.07%  4 out of 5002

    ✗ business response or no server error
      ↳  99% — ✓ 4998 / ✗ 4

    CUSTOM
    coupon_issue_business_response_under_2s...: 67.41% 3372 out of 5002
    coupon_issue_issued.......................: 4998   447.748057/s

    HTTP
    http_req_duration.........................: avg=1.28s min=0s     med=1.38s max=5.73s p(90)=2.45s p(95)=2.87s p(99)=3.62s
      { expected_response:true }..............: avg=1.28s min=3.7ms  med=1.38s max=5.73s p(90)=2.45s p(95)=2.87s p(99)=3.62s
    http_req_failed...........................: 0.07%  4 out of 5002
    http_reqs.................................: 5002   448.106399/s

    EXECUTION
    iteration_duration........................: avg=1.29s min=4.59ms med=1.38s max=5.76s p(90)=2.46s p(95)=2.88s p(99)=3.66s
    iterations................................: 5002   448.106399/s
    vus.......................................: 696    min=6            max=1188
    vus_max...................................: 3000   min=3000         max=3000

    NETWORK
    data_received.............................: 1.2 MB 106 kB/s
    data_sent.................................: 1.6 MB 142 kB/s



running (11.2s), 0000/3000 VUs, 5002 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3000 VUs  10s  500.00 iters/s